# Kubernetes
brew "kubectl"
brew "kind"

# Kubernetes tools
brew "yq"
brew "jq"
brew "helm"
brew "kustomize"
brew "kubeconform"
brew "gomplate"

# KUbernetes Test TooL (kuttl)
tap "kudobuilder/tap"
brew "kuttl-cli"

# YAML tools
brew "yamllint"
brew "homeport/tap/dyff"

# OCI tools
brew "oras"
brew "crane"
brew "cosign"

# Flux
tap "fluxcd/tap"
brew "fluxcd/tap/flux"

# Encryption
brew "age"
brew "sops"
